Core/src/DataProcessors/ОбработкаСобранныхЗаказов/ОбработкаСобранныхЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаСобранныхЗаказов</name>
</mdclass:DataProcessor>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПеремещениеЗапасов/ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТаваровНаОС</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеЗапасов</name>
  <basedOn>Document.ПеремещениеПоЯчейкам</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.СборкаЗапасов</basedOn>
  <basedOn>Document.ПриходныйОрдер</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <basedOn>Document.ПеремещениеЗапасов</basedOn>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПеремещение</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРазрезеГТД</registerRecords>
  <registerRecords>AccumulationRegister.СуммовойУчетВРознице</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКРасходуСоСкладов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКПоступлениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.СерийныеНомера</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПринятые</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозчика</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.СборкаЗапасов</types>
      <types>DocumentRef.ПеремещениеПоЯчейкам</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПечатиСсылка</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаОтправил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщикаПолучил</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКонтролера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаказаПокупателя</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтпустилДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРуководительДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеремещенияИзТранзита</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПеремещения</name>
    <type>
      <types>EnumRef.СтатусПеремещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПеремещенияВТранзит</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаКонечныйПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЯчейкиВПеремещенииЗапасов</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВДороге</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/DataProcessors/ОбработкаСобранныхЗаказов/Forms/РабочееМестоКладовщика/Module.bsl
&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Ложь;
	КонецЦикла;			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсе(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Стр.Создать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Тз.Ссылка,
	               |	Тз.Создать,
	               |	Тз.Склад
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК Тз
	               |ГДЕ
	               |	Тз.Статус = &Статус
				   |	И Тз.Создать
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказПокупателяЗапасы.Номенклатура,
	               |	ЗаказПокупателяЗапасы.Характеристика,
	               |	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	               |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	               |	ЗаказПокупателяЗапасы.Ссылка,
	               |	ВТ.Склад КАК Склад,
	               |	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв КАК СкладОтп,
	               |	СУММА(ЗаказПокупателяЗапасы.Сумма) КАК Сумма,
	               |	СУММА(ЗаказПокупателяЗапасы.Резерв) КАК Резерв
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	               |		ПО ВТ.Ссылка = ЗаказПокупателяЗапасы.Ссылка
	               |ГДЕ
	               |	ВТ.Создать = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателяЗапасы.Номенклатура,
	               |	ЗаказПокупателяЗапасы.Характеристика,
	               |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	               |	ЗаказПокупателяЗапасы.Ссылка,
	               |	ВТ.Склад,
	               |	ЗаказПокупателяЗапасы.Ссылка.СтруктурнаяЕдиницаРезерв
	               |ИТОГИ ПО
	               |	Склад,
	               |	СкладОтп";
	
	Запрос.УстановитьПараметр("ТЗ",СписокПеремещений.Выгрузить());
	Запрос.УстановитьПараметр("Статус",Справочники.СостоянияЗаказовПокупателей.Собран);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокПер(Команда)
	
	
	СоздатьДокПерНаСервере(СписокПеремещений[0].Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокРасНак(Команда)
	Для Каждого Стр Из СписокПеремещений Цикл 
		Если Стр.Создать И Стр.Статус <> ПолучитьСтатус() Тогда
			 Стр.ДокРасНак = СоздатьДокРасНакНаСервере(Стр.Ссылка,Стр.ДокПерем);
			 Стр.Статус = ПолучитьСтатус(); 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатус()
	
	Возврат Справочники.СостоянияЗаказовПокупателей.Доставлен;
	
КонецФункции	

&НаСервере 
Функция  СоздатьДокРасНакНаСервере(Ссылка,ДокПерем)
	
	Док = Документы.РасходнаяНакладная.СоздатьДокумент();
	Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
	Док.Дата = ТекущаяДата(); 
	Док.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
    Док.СтруктурнаяЕдиница = Ссылка.СтруктурнаяЕдиницаРезерв;	
	Если ЗначениеЗаполнено(ДокПерем) Тогда
		Док.СтруктурнаяЕдиница = ДокПерем.СтруктурнаяЕдиницаПолучатель;
	КонецЕсли;	
	
	//+++ Дмгг
	Если НЕ ЗначениеЗаполнено(Док.ВидНалогаНДС) Тогда 
		Док.ВидНалогаНДС = Док.Организация.ВидНалогаНДС;
	КонецЕсли;
	
	Для Каждого Строк из Док.Запасы Цикл 
		Строк.Резерв = ?(РезервированиеЗапасов, Строк.Количество, 0); //Строк.Количество; +++Дмгг
	КонецЦикла;
	//--- Дмгг
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("დოკუმენტი: " + Док + " გატარდა!");
	Исключение
		Сообщить("დოკუმენტი: " + Док + " 	ვერ გატარდა!");
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат Док.Ссылка;
	
КонецФункции	

&НаСервере 
Процедура СоздатьДокПерНаСервере(Ссылка)
	
	 	
	ВыборкаСкладОтп = ПолучитьВыборку();
	
	
	Пока ВыборкаСкладОтп.Следующий() Цикл
	сч = 1;
	
	Склад = ВыборкаСкладОтп.Склад;
	
	ВыборкаСклад = ВыборкаСкладОтп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		Док = Документы.ПеремещениеЗапасов.СоздатьДокумент();
		Док.Дата = ТекущаяДата();//Ссылка.ДатаКонцаСобран Паганини
		Док.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
		
		Если Не ЗначениеЗаполнено(Склад) И Не ЗначениеЗаполнено(СкладОтгрузки)  Тогда
			Сообщить("სტიქონში N: " + сч + " არ არის შევსებული საწყობი!");
			Продолжить;
		КонецЕсли;
		
		Док.ЗаполнитьПоЗаказуПокупателя(Ссылка);
		Док.ЗаказПокупателя = Неопределено;
		Док.ДокументОснование = Неопределено;
		//Попытка
		//	Док.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	Сообщить("დოკუმენტი: " + Док + " ვერ გატარდა!");
		//	Док.Записать(РежимЗаписиДокумента.Запись);
		//КонецПопытки;
		
		ДокОб = Док;//Док.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Склад) Тогда
			ДокОб.СтруктурнаяЕдиницаПолучатель = Склад;
			ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = Склад; 
		ИначеЕсли ЗначениеЗаполнено(СкладОтгрузки) Тогда 
			ДокОб.СтруктурнаяЕдиницаПолучатель = СкладОтгрузки;
			ДокОб.СтруктурнаяЕдиницаКонечныйПолучатель = СкладОтгрузки; 
		КонецЕсли;
		
		ДокОб.СтруктурнаяЕдиница = ВыборкаСклад.СкладОтп;
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ДокОб.ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь, "ПоложениеЗаказаПокупателяВПеремещенииЗапасов"); //Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		
		
		ДокОб.Запасы.Очистить();
		Выборка = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл 
			Стр = ДокОб.Запасы.Добавить();
			Стр.Номенклатура = Выборка.Номенклатура;
			Стр.Характеристика =  Выборка.Характеристика;  
			Стр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			Стр.Количество =  Выборка.Количество;
			Стр.СуммаЗаказа = Выборка.Сумма;
			Стр.ЗаказПокупателя = Выборка.Ссылка;
			Стр.Резерв = ?(РезервированиеЗапасов, Выборка.Резерв, 0); //Стр.Количество; +++ Дмгг
			
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", Выборка.Ссылка);
			Строки = СписокПеремещений.НайтиСтроки(Отбор);
			
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
			Для Каждого Стро Из Строки Цикл
				Стро.ДокПерем = ДокОб.Ссылка;
				Стро.Статус = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
			КонецЦикла;
			
		КонецЦикла;
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("დოკუმენტი: " + ДокОб + " გატარდა!");
		Исключение
			Сообщить("დოკუმენტი: " + ДокОб + " ვერ გატარდა!");
			ДокОб.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;	
	
    КонецЦикла;	
		
КонецПроцедуры	


&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя1.Ссылка,
	               |	ЗаказПокупателя1.Номер,
	               |	ЗаказПокупателя1.Дата,
	               |	ЗаказПокупателя1.Автор,
	               |	ЗаказПокупателя1.СостояниеЗаказа КАК Статус,
	               |	ИСТИНА КАК Создать,
	               |	ЗаказПокупателя1.Контрагент КАК Покупатель,
	               |	ПеремещениеЗапасовЗапасы.Ссылка КАК ДокПерем
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	               |		ПО (ПеремещениеЗапасовЗапасы.ЗаказПокупателя = ЗаказПокупателя1.Ссылка)
	               |			И (ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА)
	               |ГДЕ
	               |	ЗаказПокупателя1.Проведен = ИСТИНА
	               |	И (ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказа
	               |			ИЛИ ЗаказПокупателя1.СостояниеЗаказа = &СостояниеЗаказаБорт)
	               |	И ЗаказПокупателя1.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателя1.Ссылка,
	               |	ЗаказПокупателя1.Номер,
	               |	ЗаказПокупателя1.Дата,
	               |	ЗаказПокупателя1.Автор,
	               |	ЗаказПокупателя1.СостояниеЗаказа,
	               |	ЗаказПокупателя1.Контрагент,
	               |	ПеремещениеЗапасовЗапасы.Ссылка";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа",Справочники.СостоянияЗаказовПокупателей.Собран);
	Запрос.УстановитьПараметр("СостояниеЗаказаБорт",Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт);
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНач));
	Если ЗначениеЗаполнено(ДатаКон) Тогда
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон) + 1);
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) + 1 );
	КонецЕсли;
	
	
	СписокПеремещений.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОкраситьТч();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
	
	РезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
КонецПроцедуры


&НаСервере
Процедура ОкраситьТч()
	
	
	МассивИменКолонокДляПодсветки = Новый Массив;
	Для каждого Стр из Элементы.СписокПеремещений.ПодчиненныеЭлементы Цикл
		МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
	КонецЦикла;
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(, 255, ));
	
	ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СписокПеремещений.Статус");
	ЭлементУсловия.ПравоеЗначение = Справочники.СостоянияЗаказовПокупателей.ВыгруженНаБорт;
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	ЭлементУсловия.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
	КонецЦикла;

	
	
КонецПроцедуры
